Yuanzjls/Video_Player_stm32f769_disco/Core/Src/main.cpp
	  ulNotifiedValue = xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
	  if (ulNotifiedValue & 0x01)
	  {

			priority = uxTaskPriorityGet( NULL );
			vTaskPrioritySet(NULL, 0);
			wm8994_SetVolume(AUDIO_I2C_ADDRESS, volume);
			vTaskPrioritySet(NULL, priority);

	  }
	  BSP_LED_Toggle(LED2);
    //vTaskDelay(400);
  }
}


static void vTaskTouchEx(void *pvParameters)
{
	volatile uint32_t ulNotificationValue;
	TS_StateTypeDef  ts;
	static volatile GUI_PID_STATE TS_State = {0, 0, 0, 0};
	while(1)
	{
		ulNotificationValue = ulTaskNotifyTake( pdTRUE, 50 );


		if (ulNotificationValue==1)
		{
			BSP_TS_GetState((TS_StateTypeDef *)&ts);
			TS_State.Pressed = 1;
			TS_State.x = ts.touchX[0];
			TS_State.y = ts.touchY[0];
			GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);
		}
		else
		{
			if (TS_State.Pressed == 1)
			{
				TS_State.Pressed = 0;
				TS_State.x = -1;
				TS_State.y = -1;
				GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);;
			}
		}

	}
}
unsigned int RetrieveMP3Data(void * pMP3CompressedData,
unsigned int nMP3DataSizeInChars,
void * token)
{
	UINT nData_Read;

	f_read((FIL*)token, pMP3CompressedData, nMP3DataSizeInChars, &nData_Read);
	return nData_Read;
}

AudioTime Total_AudioTime;
extern char time_char[18];
WM_HWIN xhWin;
FATFS fs;
char filename[256];
extern uint8_t Play_Status;
extern uint8_t Repeat_Status;
#define Audio_BUFFER_EMPTY (0)
#define Audio_BUFFER_FULL  (1)
uint8_t state_audio[2];
static void vTaskMusic(void *pvParameters)
{

  uint32_t ulNotifiedValue;

  while(1)
  {
	  xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, osWaitForever );
	  if (ulNotifiedValue)
	  {
		if (ulNotifiedValue  & 0x01)
		{
			if (state_audio[0] == Audio_BUFFER_FULL)
			{
				memcpy((U8*)buff, (U8 *)buff_audio, block_size);
			}
			else
			{
				;
			}
			state_audio[0] = Audio_BUFFER_EMPTY;
		}
		if (ulNotifiedValue  & 0x02)
		{
			if (state_audio[1] == Audio_BUFFER_FULL)
			{
				memcpy((U8*)&buff[block_size/2], (U8 *)(buff_audio+block_size), block_size);
			}
			else
			{
				;
			}
			state_audio[1] = Audio_BUFFER_EMPTY;
		}
	  }
  }



}

uint8_t    FrameBuffer[AVI_VIDEO_BUF_SIZE];


int Get_data(uint8_t *buff, uint32_t Datalength)
{
	unsigned int length;

	f_read(&fi, buff, Datalength, &length);
	return length;
}
extern AVI_INFO Avix;
void  vTaskGUI(void *pvParameters)
{
	unsigned int length;
	FRESULT res;
	FILINFO fno;
	DIR dj;
	volatile AVISTATUS avi_res;
	HW_JPEG_Init();
	uint32_t offset, last_time, current_frame, next_frame_time, frame_per_ms, audio_pr;
	uint8_t *buf_pr = (uint8_t*)buff_audio;


	BSP_SD_Init();
	if (f_mount(&fs,(char*)"",1) == FR_OK)
	{

		f_open(&fi, "/Avi/inuyasha.avi", FA_READ);
		f_read(&fi, (U8 *)FrameBuffer, AVI_VIDEO_BUF_SIZE, &length);
		avi_res = _AVI_Init(FrameBuffer, AVI_VIDEO_BUF_SIZE);
		offset = _AVI_SearchID(FrameBuffer, AVI_VIDEO_BUF_SIZE, (U8*)"movi");
		_Avi_Get_Streaminfo(FrameBuffer + offset + 4);
		f_lseek(&fi, offset+12);
		Playback_Init(Avix.SampleRate);
		HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
		current_frame=0;
		frame_per_ms = Avix.SecPerFrame/1000;
		next_frame_time = 0;
		audio_pr = 0;
		last_time = osKernelSysTick();
		state_audio[0] = Audio_BUFFER_EMPTY;
		state_audio[1] = Audio_BUFFER_EMPTY;
		while(f_size(&fi)!=f_tell(&fi) && Avix.StreamSize<=AVI_VIDEO_BUF_SIZE)
		{

			if (AVI_AUDS_FLAG==Avix.StreamID)
			{
				while ((state_audio[1] == Audio_BUFFER_FULL) && (state_audio[0]==Audio_BUFFER_FULL))
				{
					taskYIELD();
				}

				f_read(&fi, (U8 *)FrameBuffer, Avix.StreamSize+8, &length);
				if (audio_pr+Avix.StreamSize>=(block_size<<1))
				{
					while (state_audio[0] == Audio_BUFFER_FULL)
					{
						taskYIELD();
					}
					memcpy(buf_pr+audio_pr, (U8 *)FrameBuffer, (block_size<<1)-audio_pr);
					memcpy(buf_pr, (U8 *)FrameBuffer+((block_size<<1)-audio_pr), audio_pr+Avix.StreamSize-(block_size<<1));
					audio_pr = audio_pr+Avix.StreamSize-(block_size<<1);
					state_audio[1] = Audio_BUFFER_FULL;
				}
				else if ((audio_pr <= block_size) && (audio_pr+Avix.StreamSize) >= block_size)
				{
					while (state_audio[1] == Audio_BUFFER_FULL)
					{
						taskYIELD();
					}
					memcpy(buf_pr+audio_pr, (U8 *)FrameBuffer, Avix.StreamSize);
					state_audio[0] = Audio_BUFFER_FULL;
					audio_pr+=Avix.StreamSize;
				}
				else
				{
					memcpy(buf_pr+audio_pr, (U8 *)FrameBuffer, Avix.StreamSize);
					audio_pr+=Avix.StreamSize;
				}

				_Avi_Get_Streaminfo(FrameBuffer + Avix.StreamSize);

			}
			else if (Avix.StreamID == AVI_VIDS_FLAG)
			{

				if (Avix.StreamSize >0)
				{
					if ((osKernelSysTick()-last_time) <= (next_frame_time))
					{
						f_read(&fi, (U8 *)FrameBuffer, Avix.StreamSize+8, &length);
						if (HW_JPEG_Draw_timeout(Avix.StreamSize, next_frame_time-(osKernelSysTick()-last_time)))
						{

						}
						else
						{
							current_frame++;
						}
						BSP_LED_Toggle(LED_RED);
					}
					else
					{
						f_lseek(&fi, f_tell(&fi)+ Avix.StreamSize);
						f_read(&fi, (U8 *)FrameBuffer+Avix.StreamSize, 8, &length);
					}
					next_frame_time += frame_per_ms;
				}

				_Avi_Get_Streaminfo(FrameBuffer + Avix.StreamSize);
			}

		}
		f_close(&fi);

	}
	while(1)
	{
		BSP_LED_Toggle(LED_RED);
		vTaskDelay(500);
	}

}
//higher number, higher priority
static void AppTaskCreate(void)
{
  //xTaskCreate(vTaskVolume, "TaskVolume", 512, NULL, 3, &xTaskVolume);
  xTaskCreate(vTaskMusic, "TaskMusic", 2048, NULL, 4, &xTaskMusic);
  xTaskCreate(vTaskGUI, "TaskGUI", 10240, NULL, 1, &xTaskGUI);
  //xTaskCreate(vTaskTouchEx, "TaskTouchEx", 512, NULL, 2, &xTaskTouchEx);


}
static void MPU_Config(void)
{
	MPU_Region_InitTypeDef MPU_InitStruct;

	  /* Disable the MPU */
	  HAL_MPU_Disable();

	  /* Configure the MPU as Normal Non Cacheable for the SRAM1 and SRAM2 */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0x20020000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

